src/cf/InformationRegisters/ЦППК_ИзмененныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦППК_ИзмененныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтменяемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦППК_ИзмененныеДокументы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр по переданным параметрам
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия
//  ОтменяемыйДокумент - СправочникСсылка.ДокументыПредприятия
//  ДатаОтмены - Дата
Процедура ЗаписатьДанные(Документ, ОтменяемыйДокумент, ДатаОтмены) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	МенеджерЗаписиРегистра = РегистрыСведений.ЦППК_ИзмененныеДокументы.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиРегистра.Документ = Документ;
	МенеджерЗаписиРегистра.ОтменяемыйДокумент = ОтменяемыйДокумент;
	МенеджерЗаписиРегистра.ДатаОтмены = ДатаОтмены;
	
	МенеджерЗаписиРегистра.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра по переданным параметрам
// 
// Параметры:
//  Документ  - СправочникСсылка.ДокументыПредприятия
//  ОтменяемыйДокумент  - СправочникСсылка.ДокументыПредприятия
Процедура УдалитьДанные(Документ, ОтменяемыйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	МенеджерЗаписиРегистра = РегистрыСведений.ЦППК_ИзмененныеДокументы.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиРегистра.Документ = Документ;
	МенеджерЗаписиРегистра.ОтменяемыйДокумент = ОтменяемыйДокумент;
	
	МенеджерЗаписиРегистра.Удалить();
	
КонецПроцедуры

// Читает данные в регистре по переданным параметрам (Документ)
// 
// Параметры:
//  Документ  - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Массив из Структура
// 	*Документ - СправочникСсылка.ДокументыПредприятия
//	*ДатаОтмены - Дата
Функция ПрочитатьДанные(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦППК_ИзмененныеДокументы.Документ,
	|	ЦППК_ИзмененныеДокументы.ОтменяемыйДокумент,
	|	ЦППК_ИзмененныеДокументы.ДатаОтмены
	|ИЗ
	|	РегистрСведений.ЦППК_ИзмененныеДокументы КАК ЦППК_ИзмененныеДокументы
	|ГДЕ
	|	ЦППК_ИзмененныеДокументы.Документ = &Документ";
	
	Запрос.Параметры.Вставить("Документ", Документ);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Запись Из Таблица Цикл
		
		ОписаниеДок = Новый Структура("Документ, ДатаОтмены", Запись.ОтменяемыйДокумент, Запись.ДатаОтмены);
		МассивДокументов.Добавить(ОписаниеДок);	
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

// Читает данные в регистре по переданным параметрам (ОтменяемыйДокумент)
// 
// Параметры:
//  ОтменяемыйДокумент - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Массив из Структура
// 	*Документ - СправочникСсылка.ДокументыПредприятия
//	*ДатаОтмены - Дата
Функция ПрочитатьНовыеДокументы(ОтменяемыйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦППК_ИзмененныеДокументы.Документ,
	|	ЦППК_ИзмененныеДокументы.ОтменяемыйДокумент,
	|	ЦППК_ИзмененныеДокументы.ДатаОтмены
	|ИЗ
	|	РегистрСведений.ЦППК_ИзмененныеДокументы КАК ЦППК_ИзмененныеДокументы
	|ГДЕ
	|	ЦППК_ИзмененныеДокументы.ОтменяемыйДокумент = &ОтменяемыйДокумент";
	
	Запрос.Параметры.Вставить("ОтменяемыйДокумент", ОтменяемыйДокумент);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	МассивДокументов = Новый Массив;
	
	Для Каждого Запись Из Таблица Цикл
		
		ОписаниеДок = Новый Структура("Документ, ДатаОтмены", Запись.Документ, Запись.ДатаОтмены);
		МассивДокументов.Добавить(ОписаниеДок);	
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
